sim/analysis/amr/1000000/P_8e5_8e5_1e8_3_3/250_40_1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices 
(
	(0 0 -0.04)
	(0.25 0 -0.04)
	(0.25 0.04 -0.04)
	(0 0.04 -0.04)
	(0 0 0)
	(0.25 0 0)
	(0.25 0.04 0)
	(0 0.04 0)
);

blocks
(
	hex (0 1 2 3 4 5 6 7) (250 40 1) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
	inlet 
	{
		type wall;
		faces
		(
		 	(0 3 7 4)
		);
	}

	outlet
	{
		type patch;
		faces
		(
		 	(1 5 6 2)
		);
	}

	bottom
	{
		type wall;
		faces
		(
	 		(0 4 5 1)	 
		);
	}

	top
	{
		type wall;
		faces
		(
		 	(3 2 6 7)
		);
	}

	frontAndBack
	{
		type wall;
		faces
		(
			(0 1 2 3)
			(4 7 6 5)
		);
	}

);

mergePatchPairs
(
);









// ************************************************************************* //
